Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `@RequestScoped` beans can only be injected when the xref:cdi-reference.adoc#request-context-lifecycle[CDI request context] is active. The context can be activated by users, for example with the `@ActivateRequestContext`, however authorization happens before Quarkus prepares some `@RequestScoped` beans. We recommend to let Quarkus activate and prepare CDI request context for you. For example, consider a situation where you want to inject a bean from the Jakarta REST context, such as the `jakarta.ws.rs.core.UriInfo` bean. In this case, you must apply the `HttpSecurityPolicy` to Jakarta REST endpoints. This can be achieved in one of the following ways:
ja_jp: `@RequestScoped` Bean は、 xref:cdi-reference.adoc#request-context-lifecycle[CDI リクエストコンテキスト] がアクティブな場合にのみ注入できます。コンテキストは、例えば `@ActivateRequestContext` を使用してユーザーによってアクティブ化できますが、認可は Quarkus が一部の `@RequestScoped` Bean を準備する前に行われます。Quarkus が CDI リクエストコンテキストをアクティブ化して準備することをお勧めします。たとえば、 `jakarta.ws.rs.core.UriInfo` Bean のような Jakarta REST コンテキストから Bean を注入したい状況を考えてみましょう。この場合、Jakarta REST エンドポイントに `HttpSecurityPolicy` を適用する必要があります。これは、次のいずれかの方法で実現できます。

source: `@RequestScoped` beans can only be injected when the xref:cdi-reference.adoc#request-context-lifecycle[CDI request context] is active. The context can be activated by users, for example with the `@ActivateRequestContext`, however authorization happens before Quarkus prepares some `@RequestScoped` beans. We recommend to let Quarkus activate and prepare CDI request context for you. For example, consider a situation where you want to inject a bean from the Jakarta REST context, such as the `jakarta.ws.rs.core.UriInfo` bean. In this case, you must apply the `HttpSecurityPolicy` to Jakarta REST endpoints. This can be achieved in one of the following ways: * Use the `@AuthorizationPolicy` security annotation. * Set the `quarkus.http.auth.permission.custom1.applies-to=jaxrs` configuration property.
ja_jp: `@RequestScoped` Bean は、xref:cdi-reference.adoc#request-context-lifecycle[CDI リクエストコンテキスト] がアクティブな場合にのみ挿入できます。 コンテキストは、 `@ActivateRequestContext` などを使用してユーザーが有効にできますが、Quarkus が複数の `@RequestScoped` Bean を準備する前に認可が行われます。 Quarkus を有効にして CDI リクエストコンテキストを準備することを推奨します。 たとえば、 `jakarta.ws.rs.core.UriInfo` Bean などの Jakarta REST コンテキストから Bean を挿入する状況を考えてみましょう。 この場合、Jakarta REST エンドポイントに `HttpSecurityPolicy` を適用する必要があります。これは、次のいずれかの方法で実現できます。 * `@AuthorizationPolicy` セキュリティーアノテーションを使用します。 * `quarkus.http.auth.permission.custom1.applies-to=jaxrs` 設定プロパティーを設定します。

source: `@RestStreamElementType(MediaType.APPLICATION_JSON)` tells Quarkus REST to serialize the object in JSON.
ja_jp: `@RestStreamElementType (MediaType.APPLICATION_JSON)` は、Quarkus REST にオブジェクトを JSON でシリアル化するように指示します。

source: `@RestStreamElementType(MediaType.APPLICATION_JSON)` tells RESTEasy Reactive to serialize the object in JSON.
ja_jp: `@SseElementType(MediaType.APPLICATION_JSON)` がRESTEasyにJSONでオブジェクトをシリアライズするように指示します。

source: `@RolesAllowed` indicates that the given endpoint is accessible by a caller if they have either a "Echoer" or "Subscriber" role assigned.
ja_jp: `@RolesAllowed` は、呼出側に "Echoer" または "Subscriber" ロールが割り当てられている場合、指定されたエンドポイントにアクセスできることを示しています。

source: `@RolesAllowed` indicates that the given endpoint is accessible by a caller if they have either an "Echoer" or a "Subscriber" role assigned.
ja_jp: `@RolesAllowed` は指定されたエンドポイントに、呼び出し側が “Echoer” または “Subscriber” のいずれかのロールを割り当てている場合にアクセス可能であることを示します。

source: `@RunOnVirtualThread` annotation on the `@Incoming` method ensures that the method will be called on a virtual thread.
ja_jp: `@Incoming` メソッドの `@RunOnVirtualThread` アノテーションにより、メソッドが仮想スレッドで呼び出されます。

source: `@RunOnVirtualThread` will force the method to be executed on a virtual thread. To leverage the lightweight nature of virtual threads, the default maximum concurrency for methods annotated with `@RunOnVirtualThread` is 1024. This can be changed by setting the `smallrye.messaging.worker.<virtual-thread>.max-concurrency` configuration property or using together with the `@Blocking("my-custom-pool")` annotation.
ja_jp: `@RunOnVirtualThread` は、メソッドを仮想スレッド上で強制的に実行します。 仮想スレッドの軽量な性質を活用するために、`@RunOnVirtualThread` アノテーションが付けられたメソッドのデフォルトの最大同時実行数は 1024 です。 これは、`smallrye.messaging.worker.<virtual-thread>.max-concurrency` 設定プロパティーを設定することで変更できます。 または、`@Blocking("my-custom-pool")` アノテーションと一緒に使用することで変更できます。

source: `@Scheduled#delay()` and `@Scheduled#delayUnit()` form the initial delay together.
ja_jp: `@Scheduled#delay()` と `@Scheduled#delayUnit()` は初期遅延を一緒に形成します。

source: `@Scheduled#delayed()` is a text alternative to the properties above. The period expression is based on the ISO-8601 duration format `PnDTnHnMn.nS` and the value is parsed with `java.time.Duration#parse(CharSequence)`. However, if an expression starts with a digit and ends with `d`, `P` prefix will be added automatically. If the expression only starts with a digit, `PT` prefix is added automatically. So for example, `15s` can be used instead of `PT15S` and is parsed as "15 seconds".
ja_jp: `@Scheduled#delayed()` は、上記のプロパティーの代替テキストです。 期間の表現は ISO-8601 の期間形式 `PnDTnHnMn.nS` に基づいており、値は `java.time.Duration#parse (CharSequence)` で解析されます。 ただし、式が数字で始まり、 `d` で終わる場合、 `P` の接頭辞が自動的に追加されます。式が数字だけで始まる場合、 `PT` 接頭辞が自動的に追加されます。 たとえば、 `PT15S` の代わりに `15s` を使用すると、15 秒として解析されます。

source: `@Scheduled#delayed()` is a text alternative to the properties above. The period expression is based on the ISO-8601 duration format `PnDTnHnMn.nS` and the value is parsed with `java.time.Duration#parse(CharSequence)`. However, if an expression starts with a digit, the `PT` prefix is added automatically. So for example, `15s` can be used instead of `PT15S` and is parsed as "15 seconds".
ja_jp: `@Scheduled#delayed()` は、上記のプロパティーのテキスト形式での代替です。ピリオド式は ISO-8601 duration format `PnDTnHnMn.nS` に基づいており、値は `java.time.Duration#parse(CharSequence)` で解析されます。ただし、式が数字で始まる場合は、 `PT` の接頭辞が自動的に追加されます。そのため、例えば `PT15S` の代わりに `15s` を使用することができ、「15 秒」と解析されます。

source: `@Scheduled#executionMaxDelay()` can be set to delay each execution of a scheduled method. The value represents the maximum delay between the activation of the trigger and the execution of the scheduled method. The actual delay is a randomized number between 0 and the maximum specified delay.
ja_jp: `@Scheduled#executionMaxDelay()` を設定すると、スケジュールされたメソッドの各実行を遅延できます。 この値は、トリガーのアクティブ化とスケジュールされたメソッドの実行との間の最大遅延を表します。 実際の遅延は、0 から指定された最大遅延までの間でランダムに生成された数値です。

source: `@Scheduled` provides two ways to delay the time a trigger should start firing at.
ja_jp: `@Scheduled` では、トリガーが発報を開始時刻を遅らせるための2つの方法を提供しています。

source: `@ServiceDiscoveryType` annotation defines the type of the service discovery provider. For each `ServiceDiscoveryProvider` annotated with this annotation, a configuration class will be generated. The name of the configuration class is constructed by appending `Configuration` to the name of the provider.
ja_jp: `@ServiceDiscoveryType` アノテーションは、サービスディスカバリープロバイダーのタイプを定義します。このアノテーションでアノテーションされた各 `ServiceDiscoveryProvider` に対して、設定クラスが生成されます。構成クラスの名前は、プロバイダの名前に `Configuration` を付加して構成されます。

source: `@SessionScoped` Endpoint
ja_jp: `@SessionScoped` エンドポイント

source: `@SessionScoped` beans are currently not supported. Should you really need this functionality, you'll need to use RESTEasy Classic instead of RESTEasy Reactive.
ja_jp: `@SessionScoped` Bean は現在サポートされていません。この機能が本当に必要な場合は、RESTEasy Reactive ではなく RESTEasy Classic を使用する必要があります。

source: `@SimpleBinding` is an interceptor binding.
ja_jp: `@SimpleBinding` はインターセプターバインディングです。

source: `@Singleton` and `@ApplicationScoped` endpoints are shared across all WebSocket connections. Therefore, implementations should be either stateless or thread-safe.
ja_jp: `@Singleton` および `@ApplicationScoped` エンドポイントは、すべての WebSocket 接続間で共有されます。 したがって、実装はステートレスまたはスレッドセーフのいずれかである必要があります。

source: `@Singleton` should have a slightly better performance because the is no indirection (no proxy that delegates to the current instance from the context).
ja_jp: `@Singleton` はインダイレクトがない(コンテキストから現在のインスタンスをデリゲートするプロキシーがない)ため、パフォーマンスが若干向上するはずです。

source: `@Singleton` should have a slightly better performance because there is no indirection (no proxy that delegates to the current instance from the context).
ja_jp: `@Singleton` は少しだけ良いパフォーマンスを発揮します。というのも、回り道がないからです（コンテキストから現在のインスタンスに委譲するプロキシがない）。

source: `@SseElementType(MediaType.APPLICATION_JSON)` tells RESTEasy to serialize the object in JSON.
ja_jp: `@SseElementType(MediaType.APPLICATION_JSON)` がRESTEasyにJSONでオブジェクトをシリアライズするように指示します。

source: `@Superior` is a https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#defining_qualifier_types[qualifier annotation, window="_blank"].
ja_jp: `@Superior` は、 https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#defining_qualifier_types[修飾子のアノテーション, window=_blank]です。

source: `@Superior` is a https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html#defining_qualifier_types[qualifier annotation, window="_blank"].
ja_jp: `@Superior` は link:https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html#defining_qualifier_types[修飾子アノテーション] です。

source: `@Superior` is a https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#defining_qualifier_types[qualifier annotation, window="_blank"].
ja_jp: `@Superior` は link:https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#defining_qualifier_types[修飾子アノテーション] です。

source: `@TemplateEnum` declared on a non-enum class is ignored. Also if an enum also declares the `@TemplateData` annotation then the `@TemplateEnum` annotation is ignored.
ja_jp: `@TemplateEnum` 非enumクラスで宣言されたものは無視されます。また、enum が アノテーションを宣言している場合、 アノテーションは無視される。 `@TemplateData` `@TemplateEnum`

source: `@TemplateEnum` declared on a non-enum class is ignored. Also, if an enum also declares the `@TemplateData` annotation, then the `@TemplateEnum` annotation is ignored.
ja_jp: enum 以外のクラスで宣言された `@TemplateEnum` は無視されます。また、enum が `@TemplateData` アノテーションを宣言する場合は、`@TemplateEnum` アノテーションは無視されます。

source: `@TestHTTPResource` is particularly useful when setting the management `test-port` to 0, which indicates that the system will assign a random port to the management interface:
ja_jp: `@TestHTTPResource` は、管理 `test-port` を 0 に設定する場合に特に便利です。これは、システムが管理インターフェイスにランダムなポートを割り当てることを示します。

source: `@TestSecurity` and `@JwtSecurity` can be combined in a meta-annotation, as follows:
ja_jp: `@TestSecurity` と `@JwtSecurity` は、次のようにメタアノテーションで組み合わせることができます：

source: `@TestSecurity` and `@JwtSecurity` can be combined in a meta-annotation, for example like so:
ja_jp: `@TestSecurity` と `@JwtSecurity` は、例えば次のようにメタアノテーションで組み合わせることが出来ます:

source: `@TestSecurity` and `@OidcSecurity` can be combined in a meta-annotation, as outlined in the following example:
ja_jp: `@TestSecurity` と `@OidcSecurity` は、メタアノテーションで組み合わせることができます。次の例を参照してください。

source: `@TestSecurity` and `@OidcSecurity` can be combined in a meta-annotation, for example like so:
ja_jp: `@TestSecurity` と `@OidcSecurity` は、例えばこのようにメタアノテーションで組み合わせることができます:

source: `@TestSecurity` can also be used in meta-annotations, for example like so:
ja_jp: `@TestSecurity` は、メタアノテーションでも使うことができます。例:

source: `@TestSecurity` can also be used when xref:security-authentication-mechanisms.adoc#combining-authentication-mechanisms[authentication mechanisms must be combined]. Example below shows how to select authentication mechanism when path-based authentication is enabled.
ja_jp: `@TestSecurity` は、xref:security-authentication-mechanisms.adoc#combining-authentication-mechanisms[認証メカニズムを組み合わせる必要がある] 場合にも使用できます。 以下の例は、パスベースの認証が有効な場合に認証メカニズムを選択する方法を示しています。

source: `@Transactional(MANDATORY)`: fails if no transaction was started ; works within the existing transaction otherwise.
ja_jp: `@Transactional(MANDATORY)` : トランザクションが開始されていない場合は失敗し、そうでない場合は既存のトランザクション内で動作します。

source: `@Transactional(NEVER)`: if a transaction was started, raises an exception ; otherwise works with no transaction.
ja_jp: `@Transactional(NEVER)` : トランザクションが開始されている場合は例外を発生させます。開始されていない場合はトランザクションなしで動作します。

source: `@Transactional(NOT_SUPPORTED)`: if a transaction was started, suspends it and works with no transaction for the boundary of the method ; otherwise works with no transaction.
ja_jp: `@Transactional(NOT_SUPPORTED)` : トランザクションが開始されている場合、それを一時停止し、メソッドの境界ではトランザクションなしで動作します。開始されていない場合は、トランザクションなしで動作します。

source: `@Transactional(REQUIRED)` (default): starts a transaction if none was started, stays with the existing one otherwise.
ja_jp: `@Transactional(REQUIRED)` (デフォルト): 何も開始されていない場合はトランザクションを開始し、そうでない場合は既存のトランザクションを維持します。

source: `@Transactional(REQUIRES_NEW)`: starts a transaction if none was started ; if an existing one was started, suspends it and starts a new one for the boundary of that method.
ja_jp: `@Transactional(REQUIRES_NEW)` : 何も開始されていない場合はトランザクションを開始し、既存のトランザクションが開始されている場合はそれを一時停止し、そのメソッドの境界で新しいトランザクションを開始します。

source: `@Transactional(SUPPORTS)`: if a transaction was started, joins it ; otherwise works with no transaction.
ja_jp: `@Transactional(SUPPORTS)` : トランザクションが開始されている場合、それに参加します。開始されていない場合はトランザクションなしで動作します。

source: `@Transactional` can be used to control transaction boundaries on any CDI bean at the method level or at the class level to ensure every method is transactional. That includes REST endpoints.
ja_jp: `@Transactional` は、メソッドレベルまたはクラスレベルで、すべてのメソッドがトランザクションであることを保証するために、任意の CDI Bean のトランザクション境界を制御するために使用することができます。これにはRESTエンドポイントも含まれます。

source: `@Union` is required to indicate this Java interface represents a GraphQL union, not a GraphQL interface
ja_jp: `@Union` は、このJavaインターフェースが、GraphQLインターフェースではなく、GraphQLユニオンを表していることを示すために必要です。

source: `@WithFunction(FunctionType.BACKGROUND)` indicates to launch the function as a background function. If multiple functions exist in the same application, the `functionName` attribute must be used to denote which one should be launched.
ja_jp: `@WithFunction(FunctionType.BACKGROUND)` は、その関数をバックグラウンド関数として起動することを示します。同一アプリケーション内に複数の機能が存在する場合は、 `functionName` 属性で起動する機能を指定する必要があります。

source: `@WithFunction(FunctionType.CLOUD_EVENTS)` indicates to launch the function as a cloud events function. If multiple functions exist in the same application, the `functionName` attribute must be used to denote which one should be launched.
ja_jp: `@WithFunction(FunctionType.CLOUD_EVENTS)` は、その関数をcloud events functionとして起動することを示します。同じアプリケーションに複数の関数が存在する場合、 `functionName` 属性を使用して、どの機能を起動するかを指定する必要があります。

source: `@WithFunction(FunctionType.FUNQY_BACKGROUND)` indicates to launch the function as a Funqy background function. If multiple functions exist in the same application, the `functionName` attribute must be used to denote which one should be launched.
ja_jp: `@WithFunction(FunctionType.FUNQY_BACKGROUND)` は、Funqyのバックグラウンド関数としてその関数を起動することを示します。同じアプリケーションに複数の関数が存在する場合、 `functionName` 属性を使用して、どの関数を起動させるかを示す必要があります。

source: `@WithFunction(FunctionType.FUNQY_CLOUD_EVENTS)` indicates to launch the function as a Funqy cloud events function. If multiple functions exist in the same application, the `functionName` attribute must be used to denote which one should be launched.
ja_jp: `@WithFunction(FunctionType.FUNQY_CLOUD_EVENTS)` は、その関数を Funqy クラウドイベント関数として起動することを示します。同じアプリケーションに複数の機能が存在する場合、 `functionName` 属性を使用して、どの関数を起動させるかを示す必要があります。

source: `@WithFunction(FunctionType.HTTP)` indicates to launch the function as an HTTP function. If multiple functions exist in the same application, the `functionName` attribute must be used to denote which one should be launched.
ja_jp: `@WithFunction(FunctionType.HTTP)` は、その関数を HTTP 関数として起動することを示します。同じアプリケーション内に複数の関数が存在する場合は、 `functionName` 属性でどの関数を起動するかを指定する必要があります。

source: `@WithFunction(FunctionType.RAW_BACKGROUND)` indicates to launch the function as a raw background function. If multiple functions exist in the same application, the `functionName` attribute must be used to denote which one should be launched.
ja_jp: `@WithFunction(FunctionType.RAW_BACKGROUND)` は、その関数を生のバックグラウンド関数として起動することを示します。同じアプリケーションに複数の関数が存在する場合、 `functionName` 属性を使用して、どの関数を起動するかを指定する必要があります。

source: `@io.quarkus.test.component.TestConfigProperty` declared on a `@Nested` test class is always ignored.
ja_jp: `@Nested` テスト クラスで宣言された `@io.quarkus.test.component.TestConfigProperty` は常に無視されます。

source: `A256KW` is the default symmetric key encryption algorithm.
ja_jp: `A256KW` はデフォルトの対称鍵暗号化アルゴリズムです。

source: `AccessTokenCredential` is used if the access token issued to the Quarkus `web-app` application is opaque (binary) and cannot be parsed to a `JsonWebToken` or if the inner content is necessary for the application.
ja_jp: `AccessTokenCredential` は、Quarkus `web-app` アプリケーションに発行されたアクセストークンが不透明 (バイナリー) で、 `JsonWebToken` に解析できない場合、または内部コンテンツがアプリケーションに必要な場合に使用されます。

source: `AccessTokenRequestFilter` treats all tokens as Strings and as such it can work with both JWT and opaque tokens.
ja_jp: `AccessTokenRequestFilter` は、すべてのトークンをStringとして扱うため、JWTトークンと不透明なトークンの両方を扱うことができます。

source: `AccessTokenRequestFilter` treats all tokens as Strings, and as such, it can work with both JWT and opaque tokens.
ja_jp: `AccessTokenRequestFilter` は、すべてのトークンをStringとして扱うため、JWTトークンと不透明なトークンの両方を扱うことができます。

source: `AccessTokenRequestFilter` treats all tokens as strings and, as such, can work with both JWT and opaque tokens.
ja_jp: `AccessTokenRequestFilter` はすべてのトークンを文字列として扱い、そのため JWT と不透明なトークンの両方で動作できます。

source: `AccessTokenRequestFilter` uses a default `OidcClient` by default. A named `OidcClient` can be selected with the `quarkus.resteasy-client-oidc-token-propagation.client-name` configuration property.
ja_jp: `AccessTokenRequestFilter` は、デフォルトでデフォルトの `OidcClient` を使用します。名前付きの `OidcClient` は、 `quarkus.resteasy-client-oidc-token-propagation.client-name` 設定プロパティーで選択できます。

source: `AccessTokenRequestFilter` uses a default `OidcClient` by default. A named `OidcClient` can be selected with a `quarkus.oidc-token-propagation.client-name` configuration property.
ja_jp: `AccessTokenRequestFilter` はデフォルトで `OidcClient` を使用します。名前付きの `OidcClient` は、 `quarkus.oidc-token-propagation.client-name` 設定プロパティーで選択することができます。

source: `AccessTokenRequestFilter` uses a default `OidcClient` by default. A named `OidcClient` can be selected with a `quarkus.resteasy-client-oidc-token-propagation.client-name` configuration property.
ja_jp: `AccessTokenRequestFilter` はデフォルトで `OidcClient` を使用します。名前付きの `OidcClient` は `quarkus.resteasy-client-oidc-token-propagation.client-name` 設定プロパティーで選択できます。

source: `AccessTokenRequestFilter` will use `OidcClient` to exchange the current token, and you can use `quarkus.oidc-client.grant-options.exchange` to set the additional exchange properties expected by your OpenID Connect Provider.
ja_jp: `AccessTokenRequestFilter` は `OidcClient` を使用して現在のトークンを交換します。 `quarkus.oidc-client.grant-options.exchange` を使用して、OpenID Connect プロバイダーが要求する追加の交換プロパティーを設定できます。

source: `AccessTokenRequestFilter` will use `OidcClient` to exchange the current token, and you can use `quarkus.oidc-client.grant-options.exchange` to set the additional exchange properties expected by your OpenID Connect provider.
ja_jp: `AccessTokenRequestFilter` は `OidcClient` を使用して現在のトークンを交換し、 `quarkus.oidc-client.grant-options.exchange` を使用して、OpenID Connect プロバイダーが要求する追加の交換プロパティーを設定できます。

source: `AccessTokenRequestReactiveFilter` uses a default `OidcClient` by default. A named `OidcClient` can be selected with a `quarkus.rest-client-oidc-token-propagation.client-name` configuration property or with the `io.quarkus.oidc.token.propagation.common.AccessToken#exchangeTokenClient` annotation attribute.
ja_jp: `AccessTokenRequestReactiveFilter` はデフォルトでデフォルトの `OidcClient` を使用します。名前付き `OidcClient` は、 `quarkus.rest-client-oidc-token-propagation.client-name` 設定プロパティまたは `io.quarkus.oidc.token.propagation.common.AccessToken#exchangeTokenClient` アノテーション属性を使用して選択できます。

source: `AccessTokenRequestReactiveFilter` uses a default `OidcClient` by default. A named `OidcClient` can be selected with a `quarkus.oidc-token-propagation-reactive.client-name` configuration property or with the `io.quarkus.oidc.token.propagation.AccessToken#exchangeTokenClient` annotation attribute.
ja_jp: `AccessTokenRequestReactiveFilter` は、デフォルトの `OidcClient` を使用します。名前付きの `OidcClient` は、 `quarkus.oidc-token-propagation-reactive.client-name` 設定プロパティーまたは `io.quarkus.oidc.token.propagation.AccessToken#exchangeTokenClient` アノテーション属性を使用して選択できます。

source: `AccessTokenRequestReactiveFilter` uses a default `OidcClient` by default. A named `OidcClient` can be selected with a `quarkus.oidc-token-propagation-reactive.client-name` configuration property.
ja_jp: `AccessTokenRequestReactiveFilter` はデフォルトでデフォルトの `OidcClient` を使用します。名前付きの `OidcClient` は `quarkus.oidc-token-propagation-reactive.client-name` 設定プロパティーで選択することができます。

source: `AccessTokenRequestReactiveFilter` uses a default `OidcClient` by default. A named `OidcClient` can be selected with a `quarkus.rest-client-oidc-token-propagation.client-name` configuration property or with the `io.quarkus.oidc.token.propagation.AccessToken#exchangeTokenClient` annotation attribute.
ja_jp: `AccessTokenRequestReactiveFilter` は、デフォルトの `OidcClient` を使用します。名前付きの `OidcClient` は、 `quarkus.rest-client-oidc-token-propagation.client-name` 設定プロパティーまたは `io.quarkus.oidc.token.propagation.AccessToken#exchangeTokenClient` アノテーション属性を使用して選択できます。

source: `AccessTokenRequestReactiveFilter` will use `OidcClient` to exchange the current token, and you can use `quarkus.oidc-client.grant-options.exchange` to set the additional exchange properties expected by your OpenID Connect Provider.
ja_jp: `AccessTokenRequestReactiveFilter` は `OidcClient` を使用して現在のトークンを交換します。 `quarkus.oidc-client.grant-options.exchange` を使用すると、OpenID Connect プロバイダーが要求する追加の交換プロパティーを設定できます。

source: `AccessTokenRequestReactiveFilter` will use `OidcClient` to exchange the current token, and you can use `quarkus.oidc-client.grant-options.exchange` to set the additional exchange properties expected by your OpenID Connect provider.
ja_jp: `AccessTokenRequestReactiveFilter` は `OidcClient` を使用して現在のトークンを交換します。また、 `quarkus.oidc-client.grant-options.exchange` を使用して、OpenID Connect プロバイダーが要求する追加の交換プロパティーを設定できます。

source: `AdditionalBeanBuildItem.Builder` can be used for more complex use cases.
ja_jp: `AdditionalBeanBuildItem.Builder` は、より複雑なユースケースに使用することができます。

source: `AdditionalBeanBuildItem` Example
ja_jp: `AdditionalBeanBuildItem` の例

source: `Age` (InputData element, of type `number`)
ja_jp: `Age` （InputData要素 、 `number` 型）

source: `AgentCard.builder()` creates the builder - constructor is now private
ja_jp: `AgentCard.builder()` がビルダーを作成します — コンストラクターは現在プライベートです

source: `AnnotationsTransformerBuildItem` Example
ja_jp: `AnnotationsTransformerBuildItem` の例

source: `AroundInvoke` denotes a method that interposes on business methods.
ja_jp: `AroundInvoke` とは、ビジネスの方法に口出しする方法を指します。

source: `AsyncResult` is a structure capturing this outcome. It contains the result (of type `<T>`) produced by the operation, or the failure if it failed.
ja_jp: `AsyncResult` は、この結果をキャプチャする構造体です。これは、操作によって生成された結果 ( `<T>` 型)、または失敗した場合の失敗を含みます。

source: `AutoAddScopeBuildItem` Example
ja_jp: `AutoAddScopeBuildItem` の例

source: `BCFIPSJSSE` provider option is currently not supported in native image.
ja_jp: `BCFIPSJSSE` プロバイダーオプションは、現在ネイティブイメージではサポートされていません。
